#include <iostream>

int main()
{
    setlocale(LC_ALL, "Rus");
    std::cout << "Послушайте\nВедь, если звезды зажигают —\nзначит — это кому-нибудь нужно?\nЗначит — кто-то хочет, чтобы они были?\nЗначит — кто-то называет эти плевочки жемчужиной?\n\nИ, надрываясь\nв метелях полуденной пыли,\nврывается к богу,\nбоится, что опоздал,\nплачет,\nцелует ему жилистую руку,\nпросит —\nчтоб обязательно была звезда!—\nклянется —\nне перенесет эту беззвездную муку!\nА после\nходит тревожный,\nно спокойный наружно.\nГоворит кому-то:\n\"Ведь теперь тебе ничего?\nНе страшно?\nДа?!\"\nПослушайте!\nВедь, если звезды\nзажигают —\nзначит — это кому-нибудь нужно ?\nЗначит — это необходимо,\nчтобы каждый вечер\nнад крышами\nзагоралась хоть одна звезда?!\n";
}